.metadata/.plugins/org.eclipse.core.resources/.history/6f/2001443604c9001a1586a9901b37332e

package chaining;

import static io.restassured.RestAssured.*;
import io.restassured.path.xml.XmlPath;
import io.restassured.response.Response;

import org.testng.Assert;
import org.testng.annotations.Test;


public class APIChaining {
	
	@Test
	public void validateCapital() throws Exception {
		
		baseURI = "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL";
		
		String countryName = "India";

		String expected_capital = "New Delhi";
		
		String requestCountryCode =
				 
			 	"<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n" +
			 			"<Body>\r\n" +
			 				"<CountryISOCode xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n" +
			 					"<sCountryName>"+countryName+"</sCountryName>\r\n" +
			 				"</CountryISOCode>\r\n" +
			 			"</Body>\r\n" +
		        "</Envelope>";
		
				
		
		Response responseCountryCode = null;
				
		responseCountryCode =
				
				given()
					.header("Content-Type", "text/xml")
					.and()
					.body(requestCountryCode).
				when()
					.post().
				then()
					.statusCode(200)
					.log().all()
					.extract().response();
		
		XmlPath xml = new XmlPath(responseCountryCode.asString());
		
		String countryCode = xml.getString("CapitalCityResult");
		
		String requestCapitalCity =
				 
			 	"<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n" +
			 			"<Body>\r\n" +
			 				"<CapitalCity xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n" +
			 					"<sCountryISOCode>"+countryCode+"</sCountryISOCode>\r\n" +
			 				"</CapitalCity>\r\n" +
			 			"</Body>\r\n" +
		        "</Envelope>";

		
	}

}
